Tutorial1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forcesBlade1
    {
        type          forces;
        libs ( "libforces.so" );

        writeControl  timeStep;
        timeInterval  1;

        log           true;

        patches       (blade1);
        rho           rhoInf;
        log           true;
        rhoInf        1;          // Redundant for incompressible

        CofR          (0 0 0);    // Rotation around centre line of propeller
        pitchAxis     (0 1 0);
      }

    forcesBlade2
    {
        type          forces;
        libs ( "libforces.so" );

        writeControl  timeStep;
        timeInterval  1;

        log           true;

        patches       (blade2);
        rho           rhoInf;
        log           true;
        rhoInf        1;          // Redundant for incompressible

        CofR          (0 0 0);    // Rotation around centre line of propeller
        pitchAxis     (0 1 0);
      }
    forcesBlade3
    {
        type          forces;
        libs ( "libforces.so" );

        writeControl  timeStep;
        timeInterval  1;

        log           true;

        patches       (blade3);
        rho           rhoInf;
        log           true;
        rhoInf        1;          // Redundant for incompressible

        CofR          (0 0 0);    // Rotation around centre line of propeller
        pitchAxis     (0 1 0);
      }
    forcesBlade4
    {
        type          forces;
        libs ( "libforces.so" );

        writeControl  timeStep;
        timeInterval  1;

        log           true;

        patches       (blade4);
        rho           rhoInf;
        log           true;
        rhoInf        1;          // Redundant for incompressible

        CofR          (0 0 0);    // Rotation around centre line of propeller
        pitchAxis     (0 1 0);
      }
    forcesBlade5
    {
        type          forces;
        libs ( "libforces.so" );

        writeControl  timeStep;
        timeInterval  1;

        log           true;

        patches       (blade5);
        rho           rhoInf;
        log           true;
        rhoInf        1;          

        CofR          (0 0 0);    
        pitchAxis     (0 1 0);
      }
    forcesBlade6
    {
        type          forces;
        libs ( "libforces.so" );

        writeControl  timeStep;
        timeInterval  1;

        log           true;

        patches       (blade6);
        rho           rhoInf;
        log           true;
        rhoInf        1;          

        CofR          (0 0 0);    
        pitchAxis     (0 1 0);
      }


}
// ************************************************************************* //
