Tutorial1/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
	// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MRFImpeller
{
     cellZone    cellMRFzone;
     active      yes;   //cellZone    MRF;

    // Fixed patches (by default they 'move' with the MRF zone)
    nonRotatingPatches ();

    origin    (0 0 0);
    axis      (0 1 0);
    omega     26.18;// 250 RPM
}

// ************************************************************************* //
