Tutorial1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
       inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }
    outlet
    {
        type            zeroGradient;
    }

    vessel
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }

    impeller
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade3
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade4
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    blade5
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade6
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
