Tutorial1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     inlet
    {
        type      calculated;
        value     uniform 0;
    }
    outlet
    {
        type      calculated;
        value     uniform 0;
    }
    vessel
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    impeller
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    blade1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    blade2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    blade3
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    blade4
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    blade5
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    blade6
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
